NAMES = {
    'm': [
        'Александр', 'Михаил', 'Иван', 'Максим', 'Артём', 'Даниил', 'Дмитрий', 'Кирилл', 'Андрей', 'Егор', 'Илья', 'Алексей', 'Владимир', 'Матвей', 'Тимофей', 'Ярослав', 'Роман', 'Фёдор', 'Никита', 'Марк', 'Сергей', 'Николай', 'Владислав', 'Степан', 'Глеб', 'Лев', 'Павел', 'Евгений', 'Арсений', 'Константин',
    ],
    'f': [
        'Мария', 'Анастасия', 'Анна', 'Варвара', 'Виктория', 'Полина', 'Алиса', 'София', 'Елизавета', 'Дарья', 'Александра', 'Ксения', 'Екатерина', 'Арина', 'Софья', 'Милана', 'Вероника', 'Валерия', 'Василиса', 'Ева', 'Ульяна', 'Кира', 'Татьяна', 'Маргарита', 'Таисия', 'Алёна', 'Кристина', 'Алина', 'Ольга', 'Вера', 
    ]
}

SURNAMES = {
    'm': [
        'Александрович', 'Михайлович', 'Иванович', 'Максимович', 'Артёмович', 'Данилович', 'Дмитриевич', 'Кириллович', 'Андреевич', 'Егорович', 'Ильич', 'Алексеевич', 'Владимирович', 'Матвеевич', 'Тимофеевич', 'Ярославович', 'Романович', 'Фёдорович', 'Никитич', 'Маркович', 'Сергеевич', 'Николаевич', 'Владиславович', 'Степанович', 'Глебович', 'Львович', 'Павлович', 'Евгеньевич', 'Арсениевич', 'Константинович',
    ],
    'f': [
        'Александровна', 'Михайловна', 'Ивановна', 'Максимовна', 'Артёмовна', 'Даниловна', 'Дмитриевна', 'Кирилловна', 'Андреевна', 'Егоровна', 'Ильинична', 'Алексеевна', 'Владимировна', 'Матвеевна', 'Тимофеевна', 'Ярославовна', 'Романовна', 'Фёдоровна', 'Никитична', 'Марковна', 'Сергеевна', 'Николаевна', 'Владиславовна', 'Степановна', 'Глебовна', 'Львовна', 'Павловна', 'Евгеньевна', 'Арсениевна', 'Константиновна',
    ]
}

LNAMES = {
    'm': [
        'Смирнов', 'Иванов', 'Кузнецов', 'Попов', 'Соколов', 'Лебедев', 'Козлов', 'Новиков', 'Морозов', 'Петров', 'Волков', 'Соловьёв', 'Васильев', 'Зайцев', 'Павлов', 'Семёнов', 'Голубев', 'Виноградов', 'Богданов', 'Воробьёв', 'Фёдоров', 'Михайлов', 'Беляев', 'Тарасов', 'Белов', 'Комаров', 'Орлов', 'Киселёв', 'Макаров', 'Андреев',
    ],
    'f': [
        'Иванова', 'Смирнова', 'Кузнецова', 'Попова', 'Васильева', 'Петрова', 'Соколова', 'Михайлова', 'Новикова', 'Фёдорова', 'Морозова', 'Волкова', 'Алексеева', 'Лебедева', 'Семенова', 'Егорова', 'Павлова', 'Козлова', 'Степанова', 'Николаева', 'Орлова', 'Андреева', 'Макарова', 'Никитина', 'Захарова', 'Калачева', 'Грибов', 'Елизарова', 'Боброва',
    ]
}